Templates/getObjectsProps.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope
      xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
      s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <s:Body>
    <u:getObjectsProps
          xmlns:xs="http://www.w3.org/2001/XMLSchema"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
          xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/"
          xmlns:ricoh="http://www.ricoh.co.jp/xmlns/schema/rdh/commontypes"
          xmlns:u="http://www.ricoh.co.jp/xmlns/soap/rdh/udirectory">
      <sessionId />
      <objectIdList xsi:type="soap-enc:Array" soap-enc:arrayType="xs:string[]" />
      <selectProps xsi:type="soap-enc:Array" soap-enc:arrayType="xs:string[]">
        <item>id</item>
        <item>index</item>
        <item>name</item>
        <item>longName</item>
        <item>displayedOrder</item>
        <item>tagId</item>
        <item>auth:</item>
        <item>auth:name</item>
        <item>lastAccessDateTime</item>
        <item>remoteFolder:</item>
        <item>remoteFolder:type</item>
        <item>remoteFolder:path</item>
        <item>remoteFolder:port</item>
        <item>remoteFolder:accountName</item>
        <item>mail:</item>
        <item>mail:address</item>
        <item>isSender</item>
        <item>isDestination</item>
      </selectProps>
    </u:getObjectsProps>
  </s:Body>
</s:Envelope>
